{
  "activation_function": "gelu_new",
  "architectures": [
    "RecSysMetaModel"
  ],
  "attn_pdrop": 0.1,
  "bos_token_id": 50256,
  "embd_pdrop": 0.1,
  "eos_token_id": 50256,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-12,
  "layer_norm_epsilon": 1e-05,
  "model_type": "gpt2",
  "n_ctx": 20,
  "n_embd": 320,
  "n_head": 1,
  "n_inner": 1280,
  "n_layer": 1,
  "n_positions": 20,
  "output_attentions": true,
  "resid_pdrop": 0.1,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "vocab_size": 390000
}
